{
    "personalHead" : "Create your own goal",
    "createPersonal" : "Creating {{type}}",
    "editPersonal" : "Editing \"{{title}}\"",
    "createCategory" : "Create category",
    "createTask" : "Create task",
    "createLevel" : "Create level",
    "createAchievement" : "Create achievement",
    "select" : "Select",
    "noChildren" : "This entity is empty.",
    "alias" : "Alias",
    "title" : "Title",
    "levelNum" : "Number of the level",
    "repetition" : "Number of task repetition required for this level",
    "timeframe" : "Number of days in which the level should be completed",
    "image" : "Select Image",
    "color" : "The theme color",
    "bg_color" : "The background color. Normally white",
    "type" : "Type",
    "saveSuccess" : "Changes successfully saved.",
    "createSelect" : "Home",
    "save" : "Save",
    "cancel" : "Cancel",
    "hint" : "Hint",
    "createTaskHint" : "Hey! Please fill the information below to create a task, which you can after that use to create your achievement. You can also skip this step and use an existing task by clicking \"Skip\"",
    "skipStep" : "Skip Step",
    "success" : "Success!",
    "taskOkCreate" : "You have successfully created your task. You can now continue and create your achievement.",
    "taskNextStep" : "Create Achievement",
    "taskGoToEdit" : "You can also edit the task you just created by clicking the button bellow.",
    "taskEditButton" : "Edit Task",
    "taskOkEdit" : "You have successfully saved your task. You can create an achievement with this task by clicking on the button bellow.",
    "continueEdit" : "You can continue edditing by clicking \"Close\"",
    "closeButton" : "Close",
    "createAchievementHint1" : "You created a task in the previous step. You are now ready to create an achievement with it. Please fill out the data below and click \"save\".",
    "createAchievementHint2" : "You chose to use an existing task for your achievement. Please select one of your tasks by clicking on the button \"Select Task\" below.Then fill out the fields that appear and click \"save\".",
    "achievementEditButton" : "Edit Achievement",
    "achievementOkCreate" : "You have successfully created your achievement. You can now view your achievement.",
    "achievementGoToEdit" : "You can also edit the achievement you created by clicking the button below.",
    "achievementOkEdit" : "You have successfully saved your achievement. You can view it by clicking the button below.",
    "achievementViewButton" : "View Achievement",
    "createLevelProcessHint" : "Hey! You may notice that you can not edit the number of required task repetitions and the timeframe for \"Level 1\" of each achievement. The first level is the basic level you start off with. It never has requirements.",
    "levelOkCreate" : "You have successfully added your level to your achievement. You can click the button below to view your achievement.",
    "levelGoToEdit" : "You can also edit the level you just created by clicking the \"Edit Level\" button",
    "levelEditButton" : "Edit Level",
    "levelViewButton" : "View Achievement",
    "levelOkEdit" : "You have successfully edited your level. Click on the button below to view the achievement.",
    "selectIcon" : "Select Icon",
    "searchIcons" : "Search in icons",
    "fontAwesome" : "Font Awesome",
    "ionicIcons" : "Ionic Icons",
    "iconSelection" : "Icon Selection",
    "iconSelectionHint" : "Select an icon from below",
    "selected" : "Seleceted",
    "quickCreateText" : "If you select this option, you will only fill out the most basic info about the task you want to complete and everything else will be auto-generated for you (Good for beginners).",
    "quickCreateButton" : "Quick Create",
    "customCreateText" : "This option provides you with full customization. You will be led through a step by step process which will help you create your own task, then a custom achievement and levels.",
    "customCreateButton" : "Custom Create",
    "firstLevelRequirement" : "First level requirement: ",
    "generate" : "Generate Achievement",
    "quickTaskTitleHint" : "Hey! First you need to create a title for your Achievement.",
    "quickTaskDescriptionHint" : "What do you want to do to complete this achievement? Describe it here so you can check it out later.",
    "quickTaskImageHint" : "Here you need to select an icon that best represents your Achievement.",
    "quickTaskBgImageHint" : "You can upload an image to use as background of your Achievement to personalize it better. You can also chose from images you already uploaded.",
    "selectBgImage" : "Select a background image",
    "viewGallery" : "View gallery",
    "uploadBgImage" : "You can upload an image",
    "orChooseGallery" : "Or you can select from your gallery: ",
    "upload" : "Upload",
    "quickTaskColorHint" : "Here you can pick the theme color.  That is the color of the Achievement's progress bar.",
    "quickAchvTypeHint" : "You need to pick the type of your Achievement. One-Timed achievements are those you only want to complete once. Repeatable achievements are those you complete a lot. Timed achievements are those you complete a lot in a set period of time.",
    "quickTimedHint" : "You have chosen Timed achievement. This will create an achievement for which you need to complete your task repeatedly for a set period of time (ex. 15 reps in 30 days). Please select the number of reps you want to do in every 30 day period.",
    "quickRepeatableHint" : "You have chosen Repeatable achievement. This will create an achievement for which you need to complete your task repeatedly (ex. 15 reps). Please select the number of reps you want to do on the first level, and we will generate more levels for you.",
    "quickOneTimeHint" : "You have selected One Time achievement. This will create an achievement for which you only need to complete your task once.",
    "okQuickCreate" : "Good job! Your achievement has been successfully generated. Please click on the button below to view it.",
    "completedOn" : "Completed on: "
 }
