{
    "home": "Home",
    "navigation": "Navigation",
    "categories": "Categories",
    "favourites": "Favourites",
    "profile": "Profile",
    "errors" : "Errors",
    "locked" : "Locked",
    "costs" : "Costs",
    "youHave" : "You have",
    "unlock" : "Unlock",
    "greetingsText" : "Hey there! Welcome to Achieve. This app is aimed at people that want to constantly improve themselves. It lets you follow quantifiable goal. Achieve helps you stay motivated by providing you with a fun Achievement system. This gives you an incentive to perform mundaine or repetative tasks, as well as work towards a big goal. So what are you waiting for? ",
    "imIn" : "I'm in, Let's go!",
    "haveAnAccount" : "I already have an account.",
    "welcome" : "Welcome!",
    "categoryTip" : "Welcome to the tutorial. This is the category page. Here you can select from a range of different categories to improve yourself in. Click on the \"Lifestyle\" category to continue.",
    "lockedTip" : "This is the achievement page. Let's complete your first achievement. You can see the locked icon in the middle of the achievement. This means the achievement is locked. To unlock it you need energy. Click to continue.",
    "energyReqTip" : "This shows how much energy is required to unlock this achievement. You can earn more energy by completing achievements. Click to continue.",
    "userEnergyTip" : "This shows how much energy you have at the moment. Click to continue.",
    "moreInfoTip": "Click on the achievement to see more info about it.",
    "moreInfoOpenTip" : "You can click on the image of the achievement to view more about it.",
    "moreInfoDescTip" : "This is the achievement's description. It tells you what you have to do to complete this achievement. Click to continue.",
    "moreInfoCloseTip" : "Click here again to close the description.",
    "unlockTip" : "Now that you know what the achievement is, you can click here to unlock it.",
    "progressTip" : "Good Job! You have unlocked your achievement. This is the achievements progress. It will fill as you complete it's requirements. Click to continue.",
    "thisLevelTip" : "This shows how many times you have completed the achievement this level and how many times you have completed it across all levels. Click to continue.",
    "favouriteTip" : "You can click here to favourite your achievement. It will appear in your Favourites tab.",
    "completeTip" : "You are almost done! Click here to complete this achievement",
    "doneTip" : "Great! You have completed the tutorial. Click here to continue.",
    "register" : "Register",
    "registerText" : "You successfully completed the tutorial. To continue achieving please fill register your account.",
    "email" : "E-mail",
    "password" : "Password",
    "re_password" : "Confirm Password"
}
